app/controllers/accounts_controller.rb

  def create
    @account = Account.new(account_params)


    if @account.save
---
INSERT INTO "accounts" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "18754949038"], ["password", "112233"], ["created_at", "2015-11-10 12:10:39.315818"], ["updated_at", "2015-11-10 12:10:39.315818"]]

  def show
    @account = Account.find(params[:id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT 1  [["id", 0]]