app/controllers/login_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."username" = ? LIMIT 1  [["username", "lcm"]]
---
  def validate

    @account = Account.new(login_params)
    username = @account.username
    password = @account.password
    @msg = "login success!"
    @acc = Account.find_by_username(username)